data_generation/simulation_results/openfoam/case_58/Allrun.pre
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions
#------------------------------------------------------------------------------

runApplication gmshToFoam circuit_mesh.msh
runApplication changeDictionary

runApplication splitMeshRegions -cellZones -overwrite

#------------------------------------------------------------------------------
