data_generation/simulation_results/openfoam/case_58/constant/simParams
nIter 2000;
hComponent0 1123.7898805793525;
hComponent1 772.4422215110446;
hComponent2 1463.7172170963104;
hComponent3 1367.9463663476417;
hComponent4 1464.6499228214807;kComponent0 14.142379802610979;
kComponent1 67.53936214198632;
kComponent2 98.01710978964114;
kComponent3 59.76040575625368;
kComponent4 12.631411313547575;
tAmbient 300;
Ux 1.3920045003369002;
kPCB 0.665501863305007;